uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
// test_stm32f4_flash - the reference bench suite for the STM32F4's
// EMBEDDED FLASH MEMORY INTERFACE: the sector map computed from the
// size register, the keyed lock, the program and erase engine with its
// four error flags, the interrupt, the option bytes, and the two
// numbers this family's flash is really about - how long the core is
// FROZEN while a sector erases, and what a second program into an
// already programmed word does.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE. The console is the board's own bridge and everything
// measured is inside the chip. The RULER IS TIM2, a free-running 32-bit
// microsecond counter: the kernel tick cannot time an erase, because
// SysTick's interrupt is not TAKEN while the core is stalled on the
// flash - which is itself one of the things the suite measures.
//
// WHAT IT COSTS. The flash of this family is good for 10 000 erase
// cycles a sector (DS10314 table 47). Letters e, f, g and h ERASE, and
// are therefore OUT of the z set and asked for by name: one full round
// of them spends four cycles of the test sector, one of each smaller
// free sector, and two writes of the configuration sector. THE TEST
// ZONE IS THE LAST SECTOR OF THE ARRAY and every letter checks first
// that it lies above the image's own last byte (the linker's .data load
// address plus its length); on a part where it does not, the letter
// says so and does nothing.
//
// Letter k is the one that cannot be undone by another letter: a wrong
// unlock key locks the flash interface until the next RESET. It is last
// in the menu, out of z, and after it the board wants a re-flash.
//
// What is exercised, letter by letter:
//   a  the array: the size register, the banks, the sector map walked
//      and checked against the total, the image's own sectors, the OTP
//      and the option bytes decoded
//   b  the lock: LOCK out of reset, the keyed unlock, its idempotence,
//      and an erase refused while it stands
//   c  the four malformed sequences, each aborted by the silicon with
//      its own flag and nothing written
//   d  the error interrupt: OPERR exists only while ERRIE is set, and
//      the vector with the ISR body behind it
//   e  erase and program the last sector: the blank check, a block
//      written and read back, the CRC over it, the timings   (WEAR)
//   f  a second program into a programmed word: the AND, and the one
//      that needs an erase                                   (WEAR)
//   g  the erase stall: one sector of each size, the turns the core
//      completed, the ART on and off, the tick's loss         (WEAR)
//   h  write protection through the option bytes: a sector protected,
//      the WRPERR it earns, and the way back                  (WEAR)
//   k  a wrong unlock key: the engine locked until reset      (LAST)
//
// build: boards = f429zi,f446re,f411ce,f469ni
// build: monitor_speed = 115200

#include <stdint.h>

#include <optional>
#include <span>

#include "stm32f4/clock.hpp"
#include "stm32f4/delay.hpp"
#include "stm32f4/flash.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/reset.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/tim.hpp"
#include "stm32f4/usart.hpp"
#include "util/crc.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx) || defined(STM32F469xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F469xx)
using Led = Pin<'G', 6>;   // LD1, lit when low
constexpr UartPins console_pins{.tx = {'B', 10, PinFunction::af7}, .rx = {'B', 11, PinFunction::af7}};
constexpr uint8_t console_instance = 3;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial> bench;

/// TIM2, free-running at 1 MHz over 32 bits: the only ruler in the chip
/// that keeps counting while the core is frozen on the flash.
using Ruler = Tim<2>;
uint32_t us_now() { return Ruler::count(); }
uint32_t us_since(uint32_t t0) { return us_now() - t0; }

// The image's own last byte in the flash: .data's load address plus its
// length, which is where the linker stopped writing. Everything above it
// is fair game for an erase; everything below is the running program.
extern "C" {
extern uint32_t __data_load_start;
extern uint32_t __data_start;
extern uint32_t __data_end;
}
uint32_t image_end() {
    return reinterpret_cast<uint32_t>(&__data_load_start) +
           (reinterpret_cast<uint32_t>(&__data_end) - reinterpret_cast<uint32_t>(&__data_start));
}

/// The test zone: the LAST sector of the array, and only if the image
/// ends below it.
std::optional<FlashSector> test_sector() {
    const uint8_t n = Flash::sector_count();
    if (n == 0u) {
        return std::nullopt;
    }
    const std::optional<FlashSector> s = Flash::sector_at(static_cast<uint8_t>(n - 1u));
    if (!s || s->base < image_end()) {
        return std::nullopt;
    }
    return s;
}

/// Say why a wear letter cannot run, once, in the same words.
bool have_test_sector(const std::optional<FlashSector>& s) {
    if (s) {
        return true;
    }
    print(serial, "  no free sector to work in: the map is unknown on this part class, or "
                  "the image reaches the last sector", crlf);
    bench.verdict("a test sector above the image", false);
    return false;
}

/// The bytes of a word, little-endian, for the program verb's span.
struct Word {
    uint8_t byte[4];
    explicit Word(uint32_t v)
        : byte{static_cast<uint8_t>(v), static_cast<uint8_t>(v >> 8),
               static_cast<uint8_t>(v >> 16), static_cast<uint8_t>(v >> 24)} {}
    std::span<const uint8_t> span() const { return std::span<const uint8_t>{byte, 4}; }
};

uint32_t read_word(uint32_t addr) { return *reinterpret_cast<const volatile uint32_t*>(addr); }

/// The flags of a status mask, spelled.
void print_flags(uint32_t mask) {
    if (mask == 0u) {
        print(serial, "none");
        return;
    }
    if (mask & FlashFlag::refused) print(serial, "refused ");
    if (mask & FlashFlag::operation_error) print(serial, "OPERR ");
    if (mask & FlashFlag::write_protect_error) print(serial, "WRPERR ");
    if (mask & FlashFlag::alignment_error) print(serial, "PGAERR ");
    if (mask & FlashFlag::parallelism_error) print(serial, "PGPERR ");
    if (mask & FlashFlag::sequence_error) print(serial, "PGSERR ");
    if ((mask & FlashFlag::read_protect_error) != 0u) print(serial, "RDERR ");
    if (mask & FlashFlag::eop) print(serial, "EOP ");
}

