uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
// The FLASH vector's own counters, written by the ISR body's caller.
volatile uint32_t flash_irqs = 0;
volatile uint32_t flash_irq_flags = 0;

// The fault counters letter k arms.
volatile uint32_t bus_faults = 0;
volatile uint32_t hard_faults = 0;
volatile uint32_t fault_cfsr = 0;

// =============================================================================
// a - the array, its sectors and its option bytes
// =============================================================================
void ta_array() {
    const DeviceIdcode id = DeviceIdcode::read();
    print(serial, "  DEV_ID ", hex(id.dev_id), " flash ", flash_size_kbytes(), " KB, ",
          Flash::bank_count(), " bank(s) of ", Flash::bank_bytes() / 1024u, " KB, ",
          Flash::sector_count(), " sectors, image ends at ", hex(image_end()), crlf);
    bench.verdict("the size register and the array agree",
                  Flash::size_bytes() == static_cast<uint32_t>(flash_size_kbytes()) * 1024u);
    bench.verdict("this part class's chapter 3 was read, so there is a sector map",
                  Flash::geometry_known && Flash::sector_count() > 0u);

    // The map, walked: every sector printed, contiguous, and adding up.
    uint32_t at = Flash::base;
    bool contiguous = true;
    bool numbering = true;
    uint32_t total = 0;
    for (uint8_t i = 0; i < Flash::sector_count(); ++i) {
        const std::optional<FlashSector> s = Flash::sector_at(i);
        if (!s) {
            contiguous = false;
            break;
        }
        print(serial, "  sector ", s->number, " bank ", s->bank, "  ", hex(s->base), "..",
              hex(s->base + s->size - 1u), "  ", s->size / 1024u, " KB",
              s->base >= image_end() ? "  free" : "  image", crlf);
        if (s->base != at) {
            contiguous = false;
        }
        if (Flash::sector(s->number) != s) {
            numbering = false;
        }
        at += s->size;
        total += s->size;
    }
    bench.verdict("the sectors tile the array with no hole and no overlap", contiguous);
    bench.verdict("and they add up to the whole of it", total == Flash::size_bytes());
    bench.verdict("a sector looked up by the manual's number is the same sector", numbering);

    // The shape every chapter states: four of 16 KB, one of 64, the rest
    // of 128.
    const std::optional<FlashSector> s0 = Flash::sector_at(0);
    const std::optional<FlashSector> s3 = Flash::sector_at(3);
    const std::optional<FlashSector> s4 = Flash::sector_at(4);
    const std::optional<FlashSector> s5 = Flash::sector_at(5);
    bench.verdict("the first four sectors are 16 KB",
                  s0 && s3 && s0->size == 16u * 1024u && s3->size == 16u * 1024u);
    bench.verdict("the fifth is 64 KB", s4 && s4->size == 64u * 1024u);
    bench.verdict("and the rest are 128 KB", s5 && s5->size == 128u * 1024u);

    // sector_of() on the two ends of a sector and on the vector table.
    bench.verdict("the vector table is in sector 0",
                  Flash::sector_of(Flash::base) && Flash::sector_of(Flash::base)->number == 0u);
    const std::optional<FlashSector> last = Flash::sector_at(
        static_cast<uint8_t>(Flash::sector_count() - 1u));
    bench.verdict("the last byte of the array belongs to the last sector",
                  last && Flash::sector_of(Flash::base + Flash::size_bytes() - 1u) == last);
    bench.verdict("an address past the array belongs to no sector",
                  !Flash::sector_of(Flash::base + Flash::size_bytes()));
    bench.verdict("and in_main_flash() draws the same line",
                  Flash::in_main_flash(Flash::base + Flash::size_bytes() - 1u) &&
                      !Flash::in_main_flash(Flash::base + Flash::size_bytes()));

    const std::optional<FlashSector> zone = test_sector();
    if (zone) {
        print(serial, "  the test zone is sector ", zone->number, " at ", hex(zone->base), ", ",
              zone->size / 1024u, " KB", crlf);
    }
    bench.verdict("the last sector is above the image, so the wear letters have a zone",
                  zone.has_value());

    // The option bytes, decoded.
    print(serial, "  OPTCR ", hex(FlashOptions::raw()), " OPTCR1 ", hex(FlashOptions::raw_bank2()),
          " RDP ", hex(FlashOptions::rdp_code()), " level ",
          static_cast<uint8_t>(FlashOptions::rdp()), " BOR_LEV ", FlashOptions::bor_level(),
          FlashOptions::bor_off() ? " (off)" : "", crlf);
    print(serial, "  WDG_SW ", FlashOptions::iwdg_software() ? "software" : "HARDWARE",
          ", reset on Stop ", FlashOptions::reset_on_stop() ? "yes" : "no", ", on Standby ",
          FlashOptions::reset_on_standby() ? "yes" : "no", ", PCROP ",
          FlashOptions::pcrop_mode() ? "ON" : "off", ", dual-bank boot ",
          FlashOptions::dual_bank_boot() ? "on" : "off", crlf);
    bench.verdict("the part is at RDP level 0, which is where a debugger can reach it",
                  FlashOptions::rdp() == FlashRdpLevel::level0);
    bench.verdict("the watchdog option is the software one (no IWDG running since boot)",
                  FlashOptions::iwdg_software());
    bench.verdict("PCROP is off, so the nWRP bits mean write protection",
                  !FlashOptions::pcrop_mode());

    bool all_unprotected = true;
    for (uint8_t i = 0; i < Flash::sector_count(); ++i) {
        const std::optional<FlashSector> s = Flash::sector_at(i);
        if (s && FlashOptions::write_protected(s->number)) {
            all_unprotected = false;
            print(serial, "  sector ", s->number, " is WRITE PROTECTED", crlf);
        }
    }
    bench.verdict("no sector is write protected", all_unprotected);

    // The OTP: read-only here, and printed so a board that has one used
    // shows it.
    uint8_t otp[16] = {};
    const bool otp_read = Flash::read_otp(0, otp);
    print(serial, "  OTP[0..7] ");
    for (uint8_t i = 0; i < 8u; ++i) {
        print(serial, hex(otp[i]), " ");
    }
    uint8_t locked_blocks = 0;
    for (uint8_t i = 0; i < 16u; ++i) {
        if (Flash::otp_block_locked(i)) {
            ++locked_blocks;
        }
    }
    print(serial, " locked blocks ", locked_blocks, "/16", crlf);
    bench.verdict("the OTP area reads", otp_read);
    bench.verdict("a read past the OTP area is refused",
                  !Flash::read_otp(500, std::span<uint8_t>{otp, 16}));

