uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
    // The read side, against the clock task's own constants.
    print(serial, "  LATENCY ", FlashWaitStates::get(), " WS, prefetch ",
          FlashAccel::prefetch() ? "on" : "off", ", I-cache ",
          FlashAccel::icache() ? "on" : "off", ", D-cache ",
          FlashAccel::dcache() ? "on" : "off", crlf);
    bench.verdict("the latency is the one this rate needs",
                  FlashWaitStates::get() == SysClock::wait_states);
    bench.verdict("the ART accelerator is fully on", FlashAccel::prefetch() &&
                                                         FlashAccel::icache() &&
                                                         FlashAccel::dcache());
    bench.verdict("a cache reset is refused while the cache is enabled",
                  !FlashAccel::icache_reset() && !FlashAccel::dcache_reset());
    FlashAccel::flush_caches();
    bench.verdict("and flush_caches() leaves both caches as it found them",
                  FlashAccel::icache() && FlashAccel::dcache());
}

// =============================================================================
// b - the lock
// =============================================================================
void tb_lock() {
    // Whatever ran before, start from a locked engine: LOCK is a
    // write-one bit, so this is always possible.
    (void)Flash::lock();
    bench.verdict("FLASH_CR can be locked, and reads locked", Flash::locked());

    // An erase while it stands is refused BEFORE the flash is touched -
    // FlashFlag::refused and no hardware flag at all.
    const std::optional<FlashSector> zone = test_sector();
    const uint32_t locked_try =
        zone ? Flash::erase_sector(zone->number) : Flash::erase_sector(0xFFu);
    print(serial, "  an erase with LOCK set -> ");
    print_flags(locked_try);
    print(serial, crlf);
    bench.verdict("an erase on a locked engine is refused by the driver, not by the silicon",
                  locked_try == FlashFlag::refused);
    bench.verdict("and no error flag stands afterwards", Flash::errors() == 0u);

    const uint32_t t0 = us_now();
    const bool opened = Flash::unlock();
    const uint32_t unlock_us = us_since(t0);
    print(serial, "  the key pair took ", unlock_us, " us", crlf);
    bench.verdict("KEY1 then KEY2 clears LOCK", opened && !Flash::locked());
    bench.verdict("unlock() on an open engine is a no-op, not a second key pair",
                  Flash::unlock() && !Flash::locked());

    bench.verdict("lock() closes it again", Flash::lock() && Flash::locked());
    bench.verdict("and it opens again", Flash::unlock() && !Flash::locked());
    (void)Flash::lock();
}

// =============================================================================
// c - the four malformed sequences
// =============================================================================
void tc_missteps() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (!Flash::unlock()) {
        bench.verdict("the engine opens", false);
        return;
    }
    const uint32_t at = zone->base;
    const uint32_t before = read_word(at);

    struct Case {
        Flash::Misstep step;
        const char* name;
        uint32_t expect;
    };
    const Case cases[] = {
        {Flash::Misstep::store_without_pg, "a store into the array with PG clear",
         FlashFlag::sequence_error},
        {Flash::Misstep::wrong_access_width, "a byte store while PSIZE says x32",
         FlashFlag::parallelism_error},
        {Flash::Misstep::write_protected_area, "a store into the system memory",
         FlashFlag::write_protect_error},
    };
    for (const Case& c : cases) {
        const uint32_t got = Flash::provoke(c.step, at);
        print(serial, "  ", c.name, " -> ");
        print_flags(got);
        print(serial, " (SR ", hex(Flash::last_status()), ")", crlf);
        bench.verdict("the silicon names it: ", c.name, (got & c.expect) != 0u);
    }

    // The fourth is a MEASUREMENT and not a claim: the core splits an
    // unaligned word store, so which flag the engine ends up raising is
    // the silicon's answer, not the manual's.
    const uint32_t unaligned = Flash::provoke(Flash::Misstep::unaligned_word, at);
    print(serial, "  a word store two bytes off its alignment -> ");
    print_flags(unaligned);
    print(serial, " (SR ", hex(Flash::last_status()), ")", crlf);
    bench.verdict("an unaligned word store is refused by the silicon, whichever flag it picks",
                  (unaligned & FlashFlag::errors) != 0u);

    print(serial, "  the target word was ", hex(before), " and is ", hex(read_word(at)), crlf);
    bench.verdict("NOT ONE of the four wrote anything: the operation is aborted, "
                  "which is why this letter costs no endurance",
                  read_word(at) == before);
    bench.verdict("the flags are cleared behind each attempt", Flash::errors() == 0u);
    (void)Flash::lock();
}

// =============================================================================
// d - the error interrupt
// =============================================================================
void td_interrupt() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (!Flash::unlock()) {
        bench.verdict("the engine opens", false);
        return;
    }
    Nvic::enable(Flash::irq());

    // With ERRIE clear, 3.8.4 says OPERR is not even set.
    (void)Flash::interrupts(false, false);
    flash_irqs = 0;
    (void)Flash::provoke(Flash::Misstep::store_without_pg, zone->base);
    const uint32_t silent_sr = Flash::last_status();
    print(serial, "  ERRIE clear: SR ", hex(silent_sr), ", ", flash_irqs, " interrupt(s)", crlf);
    bench.verdict("PGSERR stands on its own", (silent_sr & FlashFlag::sequence_error) != 0u);
    bench.verdict("OPERR does NOT: 3.8.4 makes the flag itself conditional on ERRIE",
                  (silent_sr & FlashFlag::operation_error) == 0u);
    bench.verdict("and no interrupt is taken", flash_irqs == 0u);

    // With ERRIE set and the LINE MASKED, the same misstep raises OPERR
    // where the operation's own tail can still read it. Masked on
    // purpose: the handler clears the flags, and it would win the race
    // against the driver's own read.
    Nvic::disable(Flash::irq());
    bench.verdict("the two enables are written and read back",
                  Flash::interrupts(true, true) && Flash::end_of_operation_interrupt() &&
                      Flash::error_interrupt());
    (void)Flash::provoke(Flash::Misstep::store_without_pg, zone->base);
    print(serial, "  ERRIE set:   SR ", hex(Flash::last_status()), crlf);
    bench.verdict("OPERR is raised beside the cause", (Flash::last_status() &
                                                       FlashFlag::operation_error) != 0u);

