uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
    // The masked error latched the NVIC's pending bit all the same -
    // masking a line does not stop it being raised, only taken - so it
    // is taken down before the line is opened, or it would fire the
    // handler once for an error that is already history.
    bench.verdict("an error taken while the line was masked leaves the NVIC pending",
                  Nvic::pending(Flash::irq()));
    Nvic::clear_pending(Flash::irq());

    // And with the line open, the same misstep reaches the vector.
    flash_irqs = 0;
    flash_irq_flags = 0;
    Nvic::enable(Flash::irq());
    (void)Flash::provoke(Flash::Misstep::store_without_pg, zone->base);
    (void)delay_us(clock, 50);
    print(serial, "  the vector: ", flash_irqs, " interrupt(s), the body saw ");
    print_flags(flash_irq_flags);
    print(serial, crlf);
    bench.verdict("the FLASH vector fires on the error", flash_irqs >= 1u);
    bench.verdict("ONCE, and not twice: the level goes down with the flags the body "
                  "cleared, before the handler returns",
                  flash_irqs == 1u);
    bench.verdict("the body names what raised it",
                  (flash_irq_flags & (FlashFlag::sequence_error |
                                      FlashFlag::operation_error)) != 0u);
    bench.verdict("and nothing is left standing afterwards", Flash::errors() == 0u);

    (void)Flash::interrupts(false, false);
    bench.verdict("both enables go down again",
                  !Flash::end_of_operation_interrupt() && !Flash::error_interrupt());
    Nvic::disable(Flash::irq());
    (void)Flash::lock();
}

// =============================================================================
// e - erase and program the last sector (WEAR)
// =============================================================================
void te_round_trip() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (!Flash::unlock()) {
        bench.verdict("the engine opens", false);
        return;
    }
    // EOPIE on with the LINE MASKED: the flag exists only while its
    // enable stands (3.8.4), and letter d is where the vector is shown.
    Nvic::disable(Flash::irq());
    (void)Flash::interrupts(true, false);

    const uint32_t t0 = us_now();
    const uint32_t erased = Flash::erase_sector(zone->number);
    const uint32_t erase_us = us_since(t0);
    print(serial, "  erasing sector ", zone->number, " (", zone->size / 1024u, " KB) took ",
          erase_us, " us, ", Flash::last_wait_turns(), " poll turns, SR ",
          hex(Flash::last_status()), crlf);
    bench.verdict("the erase reports no error", erased == 0u);
    bench.verdict("EOP is set, ITS ENABLE BEING WHAT MAKES IT EXIST",
                  (Flash::last_status() & FlashFlag::eop) != 0u);
    (void)Flash::interrupts(false, false);

    // AN ERASE DOES NOT INVALIDATE THE CACHES (3.5.4: "you have to make
    // sure that these data are rewritten before they are accessed"), so
    // the blank check is made twice - once as the caches stand, once
    // after the flush - and only the second is a statement about the
    // ARRAY.
    const bool blank_cached = Flash::blank(zone->base, zone->size);
    FlashAccel::flush_caches();
    const bool blank_true = Flash::blank(zone->base, zone->size);
    print(serial, "  the sector reads erased: ", blank_true ? "yes" : "NO",
          " (before the cache flush: ", blank_cached ? "yes" : "no", ")", crlf);
    bench.verdict("the whole sector reads erased", blank_true);

    // A block of 1 KB, programmed word by word at x32.
    static uint8_t pattern[1024];
    for (uint16_t i = 0; i < sizeof(pattern); ++i) {
        pattern[i] = static_cast<uint8_t>(i * 7u + (i >> 5));
    }
    const uint32_t t1 = us_now();
    const uint32_t wrote = Flash::program(zone->base, pattern);
    const uint32_t program_us = us_since(t1);
    print(serial, "  1024 bytes at x32 took ", program_us, " us (",
          program_us * 1000u / (sizeof(pattern) / 4u), " ns a word, ",
          Flash::last_wait_turns(), " poll turns on the last one)", crlf);
    bench.verdict("the block programs with no error", wrote == 0u);

    // The read-back is a statement about the ARRAY only with the caches
    // out of the way - letter f is where that matters and this is where
    // the habit belongs.
    FlashAccel::flush_caches();
    bool exact = true;
    for (uint16_t i = 0; i < sizeof(pattern); ++i) {
        if (*reinterpret_cast<const volatile uint8_t*>(zone->base + i) != pattern[i]) {
            exact = false;
        }
    }
    const uint16_t crc_written =
        crc16(reinterpret_cast<const uint8_t*>(zone->base), sizeof(pattern));
    const uint16_t crc_source = crc16(pattern, sizeof(pattern));
    print(serial, "  CRC-16 of the block in flash ", hex(crc_written), ", of the source ",
          hex(crc_source), crlf);
    bench.verdict("every byte reads back exactly as it was written", exact);
    bench.verdict("and the CRC over the two agrees", crc_written == crc_source);

    // The far end of the sector, to prove the whole of it is reachable.
    const uint32_t far = zone->base + zone->size - 4u;
    const Word marker{0xC0FFEE00UL};
    bench.verdict("a word at the sector's last address programs",
                  Flash::program(far, marker.span()) == 0u && read_word(far) == 0xC0FFEE00UL);
    bench.verdict("and everything between the block and it is still erased",
                  Flash::blank(zone->base + sizeof(pattern), zone->size - sizeof(pattern) - 4u));

    // The bounds the driver draws before the flash is touched.
    bench.verdict("a program off the parallelism's alignment is refused",
                  Flash::program(zone->base + 1u, marker.span()) == FlashFlag::refused);
    bench.verdict("a program past the end of the array is refused",
                  Flash::program(Flash::base + Flash::size_bytes(), marker.span()) ==
                      FlashFlag::refused);
    bench.verdict("an erase of a sector this part has not got is refused",
                  Flash::erase_sector(31) == FlashFlag::refused);
    (void)Flash::lock();
}

