uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
// =============================================================================
// f - a second program into a programmed word (WEAR)
// =============================================================================
void tf_second_write() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (!Flash::unlock() || Flash::erase_sector(zone->number) != 0u) {
        bench.verdict("the test sector erases", false);
        return;
    }

    // 3.5.4: "Successive write operations are possible without the need
    // of an erase operation when changing bits from 1 to 0. Writing 1
    // requires a flash memory erase operation." Four pairs, each in a
    // 128-bit row of its own so that no two share a cache line - and
    // each read TWICE, because the same paragraph says a write "modifies
    // the data in the flash memory AND the data in the cache", which
    // makes a read-back through the D-cache a report of what was
    // WRITTEN and not of what the array now holds.
    struct Pair {
        uint32_t first;
        uint32_t second;
        const char* name;
    };
    static const Pair pairs[] = {
        {0xA5A5A5A5UL, 0x5A5A5A5AUL, "0xA5A5A5A5 then 0x5A5A5A5A"},
        {0xFFFF0000UL, 0x0000FFFFUL, "0xFFFF0000 then 0x0000FFFF"},
        {0x12345678UL, 0xFFFFFFFFUL, "0x12345678 then 0xFFFFFFFF"},
        {0x0F0F0F0FUL, 0x0F0F0F0FUL, "0x0F0F0F0F twice        "},
    };
    bool all_and = true;
    bool all_quiet = true;
    bool cache_lied = false;
    for (uint8_t i = 0; i < sizeof(pairs) / sizeof(pairs[0]); ++i) {
        const uint32_t w = zone->base + i * 16u;
        const Word one{pairs[i].first};
        const Word two{pairs[i].second};
        const uint32_t first_mask = Flash::program(w, one.span());
        const uint32_t after_first = read_word(w);   // and the line is now resident
        const uint32_t second_mask = Flash::program(w, two.span());
        const uint32_t cached = read_word(w);
        FlashAccel::flush_caches();
        const uint32_t held = read_word(w);
        print(serial, "  ", pairs[i].name, " -> the cache says ", hex(cached),
              ", the array holds ", hex(held), ", flags ");
        print_flags(first_mask | second_mask);
        print(serial, crlf);
        if (after_first != pairs[i].first) {
            all_and = false;
        }
        if (held != (pairs[i].first & pairs[i].second)) {
            all_and = false;
        }
        if (first_mask != 0u || second_mask != 0u) {
            all_quiet = false;
        }
        if (cached != held) {
            cache_lied = true;
        }
    }

    bench.verdict("A SECOND PROGRAM INTO A PROGRAMMED WORD IS ACCEPTED AND ANDS INTO IT: "
                  "the bits that were 0 stay 0, and writing a 1 over a 0 does nothing",
                  all_and);
    bench.verdict("and it raises NOTHING - no PROGERR, no refusal, whatever was there "
                  "before: there is no write-once cell on this family",
                  all_quiet);
    bench.verdict("SO THE READ-BACK IS THE ONLY WITNESS - and it has to be taken with "
                  "the caches flushed, because a write updates the D-cache with the "
                  "value WRITTEN while the array takes the AND (3.5.4)",
                  cache_lied);

    // The same thing without the cache in the way: with DCEN clear the
    // read is the array's own.
    const uint32_t w4 = zone->base + 64u;
    FlashAccel::dcache(false);
    const Word one{0xCCCC0F0FUL};
    const Word two{0x0F0FCCCCUL};
    (void)Flash::program(w4, one.span());
    (void)Flash::program(w4, two.span());
    const uint32_t bare = read_word(w4);
    FlashAccel::dcache(true);
    print(serial, "  with the D-cache off: 0xCCCC0F0F then 0x0F0FCCCC -> ", hex(bare), crlf);
    bench.verdict("with the D-cache off the read-back needs no flush and is the AND",
                  bare == (0xCCCC0F0FUL & 0x0F0FCCCCUL));
    (void)Flash::lock();
}

// =============================================================================
// g - the erase stall (WEAR)
// =============================================================================
void tg_stall() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (!Flash::unlock()) {
        bench.verdict("the engine opens", false);
        return;
    }

    // One free sector of each SIZE the map has, smallest first: the
    // duration is the datasheet's tERASE and the poll turns say whether
    // the core lived through it.
    uint32_t sizes_seen = 0;
    for (uint8_t i = 0; i < Flash::sector_count(); ++i) {
        const std::optional<FlashSector> s = Flash::sector_at(i);
        if (!s || s->base < image_end()) {
            continue;
        }
        if ((sizes_seen & s->size) != 0u) {
            continue;   // a size already measured
        }
        sizes_seen |= s->size;
        const uint32_t ticks0 = Ticker::ticks();
        const uint32_t t0 = us_now();
        const uint32_t err = Flash::erase_sector(s->number);
        const uint32_t took = us_since(t0);
        const uint32_t ticks = Ticker::ticks() - ticks0;
        print(serial, "  sector ", s->number, " (bank ", s->bank, "), ", s->size / 1024u,
              " KB: ", took, " us, ", Flash::last_wait_turns(),
              " poll turns, the kernel tick advanced ", ticks, " ms", crlf);
        bench.verdict("the erase completes with no error", err == 0u);
        if (s->bank == 1u) {
            // The image is in bank 1 on every board of this bench, so
            // this erase stalls the fetches that would have served the
            // SysTick handler.
            bench.verdict("THE CORE IS FROZEN THROUGH IT: the kernel tick, whose interrupt "
                          "cannot be taken, loses all but a millisecond or two of the wall",
                          ticks <= 2u);
        } else {
            // Read-while-write (RM0090 3.6.5): the code is in the other
            // bank and the core never notices.
            bench.verdict("the erase is in the OTHER bank, so the core runs through it and "
                          "the tick keeps its time",
                          ticks + 5u >= took / 1000u);
        }
    }

    // The ART's part in it. The poll loop is the only code running, so
    // with the instruction cache holding it the core may keep turning
    // while the array is busy; with the accelerator off it cannot fetch
    // at all. Both are printed; the erase time itself is the array's and
    // should not care.
    const uint32_t t1 = us_now();
    (void)Flash::erase_sector(zone->number);
    const uint32_t with_art = us_since(t1);
    const uint32_t turns_art = Flash::last_wait_turns();

    FlashAccel::prefetch(false);
    FlashAccel::icache(false);
    FlashAccel::dcache(false);
    (void)FlashAccel::icache_reset();
    (void)FlashAccel::dcache_reset();
    const uint32_t t2 = us_now();
    (void)Flash::erase_sector(zone->number);
    const uint32_t without_art = us_since(t2);
    const uint32_t turns_bare = Flash::last_wait_turns();
    FlashAccel::enable_all();

    print(serial, "  the same ", zone->size / 1024u, " KB sector: ART on ", with_art, " us / ",
          turns_art, " turns, ART off ", without_art, " us / ", turns_bare, " turns", crlf);
    if (zone->bank == 1u) {
        bench.verdict("with the accelerator off the core completes NO poll turn: "
                      "every instruction fetch is stalled on the array",
                      turns_bare == 0u);
    } else {
        bench.verdict("the zone is in the other bank, so the core polls throughout "
                      "whatever the accelerator does",
                      turns_bare > 0u);
    }
    bench.verdict("the erase takes the same time either way, the accelerator being "
                  "the CPU's side of the interface and not the array's",
                  with_art + with_art / 10u >= without_art &&
                      without_art + without_art / 10u >= with_art);
    bench.verdict("the ART is back on afterwards",
                  FlashAccel::prefetch() && FlashAccel::icache() && FlashAccel::dcache());
    (void)Flash::lock();
}

