uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
// =============================================================================
// h - write protection through the option bytes (WEAR)
// =============================================================================
void th_write_protection() {
    const std::optional<FlashSector> zone = test_sector();
    if (!have_test_sector(zone)) {
        return;
    }
    if (FlashOptions::rdp() != FlashRdpLevel::level0 || FlashOptions::pcrop_mode()) {
        print(serial, "  the part is not at RDP level 0 with PCROP off: an option write "
                      "would not be the reversible one figure 4 draws", crlf);
        bench.verdict("the state an option write is reversible in", false);
        return;
    }
    if (!Flash::unlock() || Flash::erase_sector(zone->number) != 0u) {
        bench.verdict("the test sector erases", false);
        return;
    }
    bench.verdict("the option engine is locked out of reset", FlashOptions::locked());
    bench.verdict("and OPTKEY1 then OPTKEY2 opens it", FlashOptions::unlock());
    bench.verdict("a second unlock is a no-op, not a second key pair",
                  FlashOptions::unlock() && !FlashOptions::locked());

    const uint8_t n = zone->number;
    const uint32_t optcr_before = FlashOptions::raw();
    const uint32_t t0 = us_now();
    const bool on = FlashOptions::protect(n, true);
    const uint32_t protect_us = us_since(t0);
    print(serial, "  protecting sector ", n, " took ", protect_us, " us, OPTCR ",
          hex(optcr_before), " -> ", hex(FlashOptions::raw()), crlf);
    bench.verdict("the option loader takes the new nWRP", on && FlashOptions::write_protected(n));
    bench.verdict("and NOTHING ELSE in OPTCR moved - the RDP byte was never in the data path",
                  (FlashOptions::raw() & ~0x0FFF0000UL) == (optcr_before & ~0x0FFF0000UL));

    const Word value{0x1234ABCDUL};
    const uint32_t denied = Flash::program(zone->base, value.span());
    print(serial, "  a program into it -> ");
    print_flags(denied);
    print(serial, ", the word reads ", hex(read_word(zone->base)), crlf);
    bench.verdict("a program into a protected sector earns WRPERR",
                  (denied & FlashFlag::write_protect_error) != 0u);
    bench.verdict("and writes nothing", read_word(zone->base) == 0xFFFFFFFFUL);

    const uint32_t denied_erase = Flash::erase_sector(n);
    print(serial, "  an erase of it -> ");
    print_flags(denied_erase);
    print(serial, crlf);
    bench.verdict("an erase of a protected sector earns WRPERR too",
                  (denied_erase & FlashFlag::write_protect_error) != 0u);

    bench.verdict("the protection comes off again", FlashOptions::protect(n, false) &&
                                                        !FlashOptions::write_protected(n));
    bench.verdict("and the sector takes a word again",
                  Flash::program(zone->base, value.span()) == 0u &&
                      read_word(zone->base) == 0x1234ABCDUL);
    bench.verdict("OPTCR is back where it started", FlashOptions::raw() == optcr_before);

    bench.verdict("the option engine locks again", FlashOptions::lock() && FlashOptions::locked());
    bench.verdict("and a protect through a locked engine is refused",
                  !FlashOptions::protect(n, true));
    (void)Flash::lock();
}

// =============================================================================
// k - a wrong unlock key (LAST: the engine is dead until a reset)
// =============================================================================
void tk_wrong_key() {
    print(serial, "  AFTER THIS LETTER the flash interface answers nothing until the board "
                  "is reset: it is the last thing to run", crlf);
    // The store is a bus error and this core reports it imprecisely, so
    // the vector is armed first - with BusFault enabled it arrives
    // there, and with it disabled it would escalate to HardFault.
    Faults::enable(false, true, false);
    (void)Faults::take();
    bus_faults = 0;
    hard_faults = 0;
    fault_cfsr = 0;

    (void)Flash::lock();
    Flash::provoke_wrong_key();
    (void)delay_us(clock, 100);

    print(serial, "  the wrong key raised ", bus_faults, " bus fault(s) and ", hard_faults,
          " hard fault(s), CFSR ", hex(fault_cfsr), crlf);
    bench.verdict("LOCK still stands", Flash::locked());

    const bool reopened = Flash::unlock();
    print(serial, "  a CORRECT key pair afterwards -> ", reopened ? "opened" : "refused",
          ", LOCK ", Flash::locked() ? "set" : "clear", ", ", bus_faults, " bus fault(s) so far",
          crlf);
    bench.verdict("THE REGISTER IS LOCKED UNTIL THE NEXT RESET: even the right sequence "
                  "does not open it again",
                  !reopened && Flash::locked());

    const std::optional<FlashSector> zone = test_sector();
    const uint32_t after = zone ? Flash::erase_sector(zone->number) : FlashFlag::refused;
    bench.verdict("so every erase and program refuses from here on",
                  after == FlashFlag::refused);
    Faults::enable(false, false, false);
}

void banner() {
    print(serial, crlf, "test_stm32f4_flash - the sector map, the engine, the option bytes, "
          "the stall", crlf);
    bench.menu();
}

} // namespace

// ---- target glue ------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#elif defined(STM32F469xx)
extern "C" void USART3_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

extern "C" void FLASH_IRQHandler() {
    flash_irq_flags = brio::Flash::isr();
    flash_irqs = flash_irqs + 1u;
}

// Letter k's two catchers. An imprecise bus error is recoverable: the
// store that raised it is already dead, so the handler clears the sticky
// bits and returns to whatever the core had reached. A storm of them
// would be a wedged core, so after eight the board reboots instead.
extern "C" void BusFault_Handler() {
    fault_cfsr = brio::Faults::read().cfsr;
    brio::Faults::clear();
    bus_faults = bus_faults + 1u;
    if (bus_faults > 8u) {
        brio::Reset::software();
    }
}
extern "C" void HardFault_Handler() {
    fault_cfsr = brio::Faults::read().cfsr;
    brio::Faults::clear();
    hard_faults = hard_faults + 1u;
    if (hard_faults > 8u) {
        brio::Reset::software();
    }
}

