uliano/brio/stm32f4/src/apps/test_stm32f4_flash.cpp
int main() {
    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output();

    // The ruler: TIM2 free-running at 1 MHz over its whole 32 bits.
    const uint32_t tim_hz = Ruler::clock_hz(clock);
    Ruler::init();
    const bool ruler_ok = Ruler::configure(brio::TimConfig{
        .prescaler = static_cast<uint16_t>(tim_hz / 1'000'000u - 1u), .period = 0xFFFFFFFFUL});
    Ruler::enable(true);

    brio::enable_interrupts();

    bench.letter('a', "the array, its sectors and its option bytes", ta_array);
    bench.letter('b', "the lock and the keyed unlock", tb_lock);
    bench.letter('c', "the four malformed sequences, each aborted", tc_missteps);
    bench.letter('d', "the error interrupt and the ISR body", td_interrupt);
    bench.letter('e', "erase and program the last sector", te_round_trip, false);
    bench.letter('f', "a second program into a programmed word", tf_second_write, false);
    bench.letter('g', "the erase stall, per sector size and per ART", tg_stall, false);
    bench.letter('h', "write protection through the option bytes", th_write_protection, false);
    bench.letter('k', "a wrong unlock key: the engine locked until reset", tk_wrong_key, false);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED", " tick=",
                    tick_ok ? "SysTick" : "FAILED", " ruler=",
                    ruler_ok ? "TIM2 1 MHz" : "FAILED", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        Led::toggle();
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
